{
  "word_to_id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<END>": 3,
    "<SEP>": 4,
    "with": 5,
    "and": 6,
    "wood": 7,
    "interior": 8,
    "house": 9,
    "medieval": 10,
    "roof": 11,
    "walls": 12,
    "medium": 13,
    "size": 14,
    "chimney": 15,
    "foundation": 16,
    "spruce": 17,
    "base": 18,
    "two": 19,
    "mushroom": 20,
    "stem": 21,
    "twin": 22,
    "style": 23,
    "granite": 24,
    "stair": 25,
    "terracotta": 26,
    "jungle": 27,
    "color": 28,
    "layers": 29,
    "smooth": 30,
    "pointed": 31,
    "sandstone": 32,
    "brick": 33,
    "basement": 34,
    "quartz": 35,
    "copper": 36,
    "a": 37,
    "red": 38,
    "small": 39,
    "stone": 40,
    "sized": 41,
    "waxed": 42,
    "block": 43,
    "birch": 44,
    "calcite": 45,
    "turret": 46,
    "oak": 47,
    "timber": 48,
    "frames": 49,
    "bigger": 50,
    "deepslate": 51,
    "concrete": 52,
    "cherry": 53,
    "nether": 54,
    "polished": 55,
    "planks": 56,
    "cut": 57,
    "dark": 58,
    "out": 59,
    "of": 60,
    "oxidized": 61,
    "0001": 62,
    "wool": 63,
    "mangrove": 64,
    "cobbled": 65,
    "1": 66,
    "mud": 67,
    "balcony": 68,
    "sand": 69,
    "rocky": 70,
    "left": 71,
    "structured": 72,
    "amethyst": 73,
    "purple": 74,
    "prismarine": 75,
    "diorite": 76,
    "blackstone": 77,
    "end": 78,
    "bamboo": 79,
    "big": 80,
    "made": 81,
    "pink": 82,
    "tunnel": 83,
    "acacia": 84,
    "elevated": 85,
    "birchwood": 86,
    "frame": 87,
    "gable": 88,
    "spikes": 89,
    "exterior": 90,
    "stairs": 91,
    "staircase": 92,
    "tiles": 93,
    "mossy": 94,
    "black": 95,
    "green": 96,
    "cyan": 97,
    "netherrack": 98,
    "wart": 99,
    "extension": 100,
    "purpur": 101,
    "exposed": 102,
    "bricke": 103,
    "stripped": 104,
    "double": 105,
    "snow": 106,
    "no": 107,
    "light": 108,
    "orange": 109,
    "without": 110,
    "attic": 111,
    "mid": 112,
    "tall": 113,
    "crimson": 114,
    "packed": 115,
    "warped": 116,
    "brown": 117,
    "pale": 118,
    "yellowish": 119,
    "primsarine": 120,
    "gray": 121,
    "white": 122,
    "on": 123,
    "3": 124,
    "brownish": 125,
    "italian": 126,
    "apartment": 127,
    "tower": 128,
    "built": 129,
    "turquoise": 130,
    "one": 131,
    "tilted": 132,
    "floors": 133,
    "middle": 134,
    "slightly": 135,
    "abandoned": 136,
    "domer": 137,
    "blue": 138,
    "unfinished": 139,
    "in": 140,
    "soul": 141,
    "basalt": 142,
    "mystic": 143,
    "structure": 144,
    "the": 145,
    "quarz": 146,
    "2": 147,
    "beige": 148,
    "maroonish": 149,
    "pinkish": 150,
    "reddish": 151,
    "desert": 152,
    "weathered": 153,
    "cobblestone": 154,
    "dormers": 155,
    "tile": 156,
    "trees": 157,
    "arabic": 158,
    "palm": 159,
    "logs": 160,
    "greek": 161,
    "moss": 162,
    "balconies": 163,
    "windowsills": 164,
    "domers": 165,
    "beehive": 166,
    "an": 167,
    "bricks": 168,
    "yellow": 169,
    "tree": 170,
    "modern": 171,
    "some": 172,
    "details": 173,
    "tuff": 174,
    "dripstone": 175,
    "savanna": 176,
    "sandstonee": 177,
    "oakstone": 178,
    "huge": 179,
    "fantasy": 180,
    "honeycomb": 181,
    "melon": 182,
    "ancient": 183,
    "debris": 184,
    "overgrown": 185,
    "residential": 186,
    "andesite": 187,
    "garage": 188,
    "covered": 189,
    "0002": 190,
    "lime": 191,
    "plank": 192,
    "soil": 193,
    "variant2": 194,
    "barn": 195,
    "ruine": 196,
    "standing": 197,
    "hyphae": 198,
    "rof": 199,
    "variant1": 200,
    "stonechimney": 201
  },
  "id_to_word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "<START>",
    "3": "<END>",
    "4": "<SEP>",
    "5": "with",
    "6": "and",
    "7": "wood",
    "8": "interior",
    "9": "house",
    "10": "medieval",
    "11": "roof",
    "12": "walls",
    "13": "medium",
    "14": "size",
    "15": "chimney",
    "16": "foundation",
    "17": "spruce",
    "18": "base",
    "19": "two",
    "20": "mushroom",
    "21": "stem",
    "22": "twin",
    "23": "style",
    "24": "granite",
    "25": "stair",
    "26": "terracotta",
    "27": "jungle",
    "28": "color",
    "29": "layers",
    "30": "smooth",
    "31": "pointed",
    "32": "sandstone",
    "33": "brick",
    "34": "basement",
    "35": "quartz",
    "36": "copper",
    "37": "a",
    "38": "red",
    "39": "small",
    "40": "stone",
    "41": "sized",
    "42": "waxed",
    "43": "block",
    "44": "birch",
    "45": "calcite",
    "46": "turret",
    "47": "oak",
    "48": "timber",
    "49": "frames",
    "50": "bigger",
    "51": "deepslate",
    "52": "concrete",
    "53": "cherry",
    "54": "nether",
    "55": "polished",
    "56": "planks",
    "57": "cut",
    "58": "dark",
    "59": "out",
    "60": "of",
    "61": "oxidized",
    "62": "0001",
    "63": "wool",
    "64": "mangrove",
    "65": "cobbled",
    "66": "1",
    "67": "mud",
    "68": "balcony",
    "69": "sand",
    "70": "rocky",
    "71": "left",
    "72": "structured",
    "73": "amethyst",
    "74": "purple",
    "75": "prismarine",
    "76": "diorite",
    "77": "blackstone",
    "78": "end",
    "79": "bamboo",
    "80": "big",
    "81": "made",
    "82": "pink",
    "83": "tunnel",
    "84": "acacia",
    "85": "elevated",
    "86": "birchwood",
    "87": "frame",
    "88": "gable",
    "89": "spikes",
    "90": "exterior",
    "91": "stairs",
    "92": "staircase",
    "93": "tiles",
    "94": "mossy",
    "95": "black",
    "96": "green",
    "97": "cyan",
    "98": "netherrack",
    "99": "wart",
    "100": "extension",
    "101": "purpur",
    "102": "exposed",
    "103": "bricke",
    "104": "stripped",
    "105": "double",
    "106": "snow",
    "107": "no",
    "108": "light",
    "109": "orange",
    "110": "without",
    "111": "attic",
    "112": "mid",
    "113": "tall",
    "114": "crimson",
    "115": "packed",
    "116": "warped",
    "117": "brown",
    "118": "pale",
    "119": "yellowish",
    "120": "primsarine",
    "121": "gray",
    "122": "white",
    "123": "on",
    "124": "3",
    "125": "brownish",
    "126": "italian",
    "127": "apartment",
    "128": "tower",
    "129": "built",
    "130": "turquoise",
    "131": "one",
    "132": "tilted",
    "133": "floors",
    "134": "middle",
    "135": "slightly",
    "136": "abandoned",
    "137": "domer",
    "138": "blue",
    "139": "unfinished",
    "140": "in",
    "141": "soul",
    "142": "basalt",
    "143": "mystic",
    "144": "structure",
    "145": "the",
    "146": "quarz",
    "147": "2",
    "148": "beige",
    "149": "maroonish",
    "150": "pinkish",
    "151": "reddish",
    "152": "desert",
    "153": "weathered",
    "154": "cobblestone",
    "155": "dormers",
    "156": "tile",
    "157": "trees",
    "158": "arabic",
    "159": "palm",
    "160": "logs",
    "161": "greek",
    "162": "moss",
    "163": "balconies",
    "164": "windowsills",
    "165": "domers",
    "166": "beehive",
    "167": "an",
    "168": "bricks",
    "169": "yellow",
    "170": "tree",
    "171": "modern",
    "172": "some",
    "173": "details",
    "174": "tuff",
    "175": "dripstone",
    "176": "savanna",
    "177": "sandstonee",
    "178": "oakstone",
    "179": "huge",
    "180": "fantasy",
    "181": "honeycomb",
    "182": "melon",
    "183": "ancient",
    "184": "debris",
    "185": "overgrown",
    "186": "residential",
    "187": "andesite",
    "188": "garage",
    "189": "covered",
    "190": "0002",
    "191": "lime",
    "192": "plank",
    "193": "soil",
    "194": "variant2",
    "195": "barn",
    "196": "ruine",
    "197": "standing",
    "198": "hyphae",
    "199": "rof",
    "200": "variant1",
    "201": "stonechimney"
  },
  "vocab_size": 202,
  "min_freq": 2
}